Revit 2021.1 API
RebarRoundingManager Properties
The RebarRoundingManager type exposes the following members.
Properties
Name | Description
ApplicableReinforcementRoundingSource
 Identifies the source of the rounding settings for this element.
ApplicableSegmentLengthRounding
 The applicable rounding for shared parameters used by rebar.
ApplicableSegmentLengthRoundingMethod
 The applicable rounding method for shared parameters used by rebar.
ApplicableTotalLengthRounding
 The applicable rounding for Bar Length and Total Bar Length parameters.
ApplicableTotalLengthRoundingMethod
 The applicable rounding method for Bar Length and Total Bar Length parameters.
Element
 The owner of the reinforcement rounding overrides.
 (Inherited from ReinforcementRoundingManager.)
IsActiveOnElement
 Defines whether reinforcement rounding is activated for the particular element.
 (Inherited from ReinforcementRoundingManager.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ReinforcementRoundingManager.)
LengthDisplayUnit |  Obsolete.
 The length units used when displaying the reinforcement rounding values.
 (Inherited from ReinforcementRoundingManager.)
SegmentLengthRounding
 The rounding for shared parameters used by rebar.
SegmentLengthRoundingMethod
 Identifies the segment length rounding method
TotalLengthRounding
 The rounding for Bar Length and Total Bar Length parameters.
TotalLengthRoundingMethod
 Identifies the total length rounding method
See Also
RebarRoundingManager Class
Autodesk.Revit.DB.Structure Namespace